<template>
    <p style="text-align: center;"><strong>ДОГОВОР АРЕНДЫ ТРАНСПОРТНОГО СРЕДСТВА</strong></p>
    <p style="font-size: 12px;">Республика Узбекистан город Ташкент Настоящий договор аренды транспортного средства
        заключен между сторонами: Гражданин(ка) Узбекистана {{ user?.name }} {{ user?.familyName }}, 1992 года
        рождения, паспорт серии _________________ , выданный _______________ года, зарегистрированный(ая) в городе
        ____________________ , в дальнейшем именуемый(ая) &laquo;Арендодатель&raquo;.</p>
    <p style="font-size: 12px;">Гражданин(ка) Узбекистана
        ____________________________________________________________________ , ___________ года
        рождения, паспорт серии _________________ , выданный _______________ года, зарегистрированный(ая) в городе
        ____________________ , в дальнейшем именуемый(ая) &laquo;Арендатор&raquo;.</p>
    <p style="font-size: 12px;">Стороны заключили настоящий договор о нижеследующем:</p>
    <p style="font-size: 12px;"><strong> 1. Предмет договора</strong></p>
    <p style="font-size: 12px;">Арендодатель передает, а Арендатор принимает во временное пользование транспортное
        средство марки
        {{ car?.car_mark.cyrillic_name }}, {{ car?.year }} года выпуска, VIN {{ car?.vin }} , номер двигателя
        {{ car?.engine_number }}, цвет {{ car?.color?.name }}, регистрационный номер {{
            booking?.order_number }} </p>
    <p style="font-size: 12px;"><strong>2. Срок аренды</strong></p>
    <p style="font-size: 12px;">Срок аренды установлен с {{ booking?.start_date }} по {{ booking?.end_date }}
        включительно.</p>
    <p style="font-size: 12px;"><strong>3. Размер арендной платы</strong></p>
    <p style="font-size: 12px;">Арендная плата устанавливается в размере {{ booking?.total_price }} сумов. Оплата
        производится ежемесячно не позднее _____ числа текущего месяца.</p>
    <p style="font-size: 12px;"><strong>4. Обязанности сторон</strong></p>
    <p style="font-size: 12px;">Арендодатель обязан передать Арендатору транспортное средство в технически исправном
        состоянии, с полным
        комплектом документов и страховкой. Арендатор обязуется использовать транспортное средство по назначению,
        соблюдать правила эксплуатации и содержать
        автомобиль в надлежащем состоянии.</p>
    <p style="font-size: 12px;"><strong>5. Ответственность сторон</strong></p>
    <p style="font-size: 12px;">Арендатор несет ответственность за все убытки и повреждения, причиненные транспортному
        средству в период аренды,
        за исключением случаев, вызванных естественным износом или обстоятельствами непреодолимой силы. В случае
        дорожно-транспортного происшествия, угона или иной потери транспортного средства Арендатор обязуется
        незамедлительно уведомить Арендодателя и компетентные органы.</p>
    <p><strong>6. Прекращение договора</strong></p>
    <p>Договор может быть расторгнут досрочно по соглашению сторон или по решению суда.</p>
    <p>Арендодатель вправе расторгнуть договор в случае неуплаты арендной платы более чем за 15 дней, нарушения условий
        эксплуатации или передачи транспортного средства третьим лицам без письменного согласия.</p>
    <p><strong>7. Прочие условия</strong></p>
    <p>Все споры, возникающие из настоящего договора, разрешаются путем переговоров, а при недостижении соглашения
        &ndash; в судебном порядке в соответствии с законодательством Республики Узбекистан.</p>
    <p>Настоящий договор составлен в двух экземплярах, имеющих равную юридическую силу, по одному для каждой стороны.
    </p>
    <p>Номер договора: {{ booking?.order_number }}</p>
    <p>Настоящий договор составлен и удостоверен нотариусом г. Ташкента
        _____________________________________________________________ , зарегистрированным в __________________________
        нотариальном округе, и подписан обеими сторонами в моём присутствии.<br /> Подписи сторон подтверждены. Договор
        зарегистрирован в реестре под номером _______________________ <br /><br /> Настоящий договор составлен в трёх
        экземплярах: один экземпляр хранится у нотариуса, второй &ndash; у арендатора, третий &ndash; у
        арендодателя.<br /><br /> Подписи сторон:<br /> 1. <br /> 2. <br /><br /> Нотариус: <br /> город
        ________________ , ___________________________ район, дом _____ , кв. _______.<br /><br /> Настоящий договор
        удостоверен нотариусом города ________________ , ________________________ района
        ________________________________________________ <br /> Удостоверено, что договор аренды транспортного средства
        подписан обеими сторонами добровольно, без принуждения.<br /> Личности сторон установлены, дееспособность
        проверена.<br /><br /> АРЕНДАТОР: <br /> АРЕНДОДАТЕЛЬ: <br /><br /> Регистрационный номер договора: <br /><br />
        Сведения о транспортном средстве направлены в органы МВД через систему нотариусов.<br /> Регистрационный номер
        транспортного средства: <br /><br /> ОБЩАЯ СТОИМОСТЬ ДОГОВОРА:<br /> 1. Общая сумма договора:
        _________________________ ( __________________________ ) сумов.<br /> 2. Сумма страхового взноса:
        ___________________ ( ________________________ ) сумов.<br /> 3. Итоговая сумма по договору: __________________
        ( _____________________ ) сумов.<br /> 4. Оплачено на момент подписания договора: ____________________ (
        ____________________________________ ) сумов.<br /> 5. Остаток к оплате: __________________________ (
        ____________________________________________ ) сумов.<br /><br /> Подпись нотариуса и печать подтверждают
        подлинность подписей и соответствие договора законодательству Республики Узбекистан.<br /><br /> Нотариус:
        _______________________<br /> Ф.И.О.</p>
</template>
<script setup>

const { user, history } = defineProps({
    booking: Object,
    user: Object,
    car: Object,
});


</script>
<style scoped>
p {
    font-size: 12px;
}
</style>